# -*- coding: utf-8 -*-
"""
Завдання 15.1

Створити функцію get_ip_from_cfg, яка очікує як аргумент на ім'я файлу, в якому
знаходиться конфігурація пристрою.

Функція повинна обробляти конфігурацію та повертати IP-адреси та маски, які
налаштовані на інтерфейсах, у вигляді списку кортежів:
* перший елемент кортежу - IP-адреса
* другий елемент кортежу - маска

Наприклад (взяті довільні адреси):
[('10.0.1.1', '255.255.255.0'), ('10.0.2.1', '255.255.255.0')]

Для отримання такого результату використовуйте регулярні вирази.
Перевірити функцію на прикладі файлу config_r1.txt.

Зверніть увагу, що в даному випадку можна не перевіряти коректність IP-адреси,
діапазони адрес і так далі, оскільки обробляється вивід команди, а не введення
користувача.

Приклад виклику функції
In [10]: get_ip_from_cfg("config_r1.txt")
Out[10]:
[('10.1.1.1', '255.255.255.255'),
 ('10.0.13.1', '255.255.255.0'),
 ('10.0.19.1', '255.255.255.0')]

"""


def get_ip_from_cfg(filename: str) -> list:
    result = []
    with open(filename, encoding="utf-8") as f:
        for line in f:
            if line.startswith(" ip address"):
                ip = line.split()[-2]
                mask = line.split()[-1]
                result.append((ip, mask))
    return result
